erpdev.СХК_Расширение/src/DataProcessors/МобильныйСклад/МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МобильныйСклад</name>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/InformationRegisters/Расш1_РегистрШтрихЭтикетка/Расш1_РегистрШтрихЭтикетка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расш1_РегистрШтрихЭтикетка</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5674c843-2642-4871-9160-0d93006f0add">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8b15-f8e1-48f5-a895-0a0068c7711a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9965e1bc-ce9d-4432-8e20-794e5ead177a">
    <name>ВариантОбособления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="15fca05d-7959-4a2b-9062-e424f3982539">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25c088f7-7f66-4e72-9549-39343550e4b5">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f1e30099-86a8-4d01-b947-c8d4e48da517">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff56eabe-a6d5-4725-a7e1-6d3c1cffefbc">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1c87bbe-4236-4da6-901a-bda05277a9f2">
    <name>РазмещениеВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0dd02b32-fdf8-46a0-b121-bd1aed1c77f6">
    <name>ТипПроизводственногоПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f569d9b-0875-46e5-af66-0afc714c2046">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5386e5e0-cdc1-4016-a59f-f459a6745b05">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0def1be0-f815-4bbb-a4d3-dbc07cf4d5f6">
    <name>СпособРаспределенияЗатратНаВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d77a8d5f-e794-448d-9882-9f1dda78982b">
    <name>ЗаказПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e68cfa9f-a198-4db0-b33e-480ff9fb854b">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c067e5d2-9a4a-46cc-b7ba-cc5d39841051">
    <name>НазначениеПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91b5bd8a-a202-4ee3-a07e-d2244bd4d2bb">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bba76997-9f21-401b-ae65-37cef98dda2a">
    <name>ОбособленноеОбеспечениеМатериаловИРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6df6fc76-a3cd-4de0-a023-25f5c09faf10">
    <name>НачатьНеРанее</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="191fc3ee-3065-4648-ad89-72b3cbf6a108">
    <name>ДатаПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb924568-6ab5-4bc3-9ed4-53888e5a2470">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eeb90a1d-fe9d-4d2c-9f7b-1bae6a5317b2">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88a5e505-c602-47c9-9dd8-4b109bf0874f">
    <name>ДинамическаяСтруктура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c294200d-e023-448f-bc98-02cfabea5b0d">
    <name>УкрупненныйЗаказПоНазначениямПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_Этаж</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="404e1a8a-c6a1-46fb-8fba-6480a129a9b2">
    <name>ДоговорНеОбязателен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01fbf6b7-c4b6-4173-a0e2-5e454a3980f7">
    <name>ДатаПотребностиУказываетсяВСтроках</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7a6e457f-9de3-483b-9f11-8235c0db3365">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="233b5572-d99b-45e9-a762-f4936b94aac4">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a32405d7-b213-4b91-8842-bc3b27c23a17">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f6dddb67-6919-4a89-9265-9a486b1adc13">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8fb6ec89-8b54-4467-a7ee-20b1f54a8233">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c67ff09-dc6c-4f19-911a-2976ef5313b3">
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fbacbd26-236a-47f5-bb88-9d9c18122600">
      <name>СписатьНаРасходы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ce2f7918-6eb6-44a1-9703-eaa30ed728d8">
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a65c298-0b01-4992-9536-0f68782c88a3">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8bec9438-5df6-40c3-b8e7-9f215d521294">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="31cf0d4b-bc85-4403-9def-9a0943d6cf54">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f3fdba30-a333-460d-ba0e-4df1604b8439">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="164c9f1e-c498-4657-8d77-c67959ec545e">
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c420c750-bfd8-4a31-8040-84765c9c2998">
      <name>ДоляСтоимости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Расш1_Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="cdf737d9-9b24-4864-95cf-cd1edb6e9b02">
      <name>ДатаПотребности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Documents/Расш1_ПоступлениеСклад/Расш1_ПоступлениеСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расш1_ПоступлениеСклад</name>
  <registerRecords>AccumulationRegister.СХК_ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/DataProcessors/МобильныйСклад/Forms/ФормаПоступление/Module.bsl
&НаКлиенте
Процедура ПоискШКQrИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если ПроверкаНаЧисло(Текст) = Истина Тогда
		Т = ПоискШК(Текст);
	Иначе
		Для сч = 3 по 7 Цикл
			Т = ПоискQR(Текст,сч);
			Если Т <> Ложь Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Если Т <> Ложь ТОгда
		Элементы.ГруппаНоменклатура.Видимость = Истина; 
		Элементы.Добавить.Видимость = Истина;  

		СоздатьГруппыРезультата(Т);
	Иначе
		Сообщить("Остаток 0");
	КонецЕсли;
		
КонецПроцедуры  

&НаСервере
Процедура СоздатьГруппыРезультата(м)
        Номенклатура = "";
        Серия = "";
        Количество = 0;
		
		Номенклатура = м[0].Номенклатура; 
		Если м[0].Серия <> "" Тогда
			Серия = м[0].Серия;
		Иначе
			ЭтаФорма.ТекущийЭлемент = Элементы.Серия;
		КонецЕсли;
		
	
КонецПроцедуры

&НаСервере
Функция ПоискШК(Ш)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Расш1_РегистрШтрихЭтикетка.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Расш1_РегистрШтрихЭтикетка КАК Расш1_РегистрШтрихЭтикетка
	|ГДЕ
	|	Расш1_РегистрШтрихЭтикетка.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Ш);
	Рез = Запрос.Выполнить().Выбрать();
	Мас = Новый Массив;

	Если Рез.Количество() >=1 Тогда
		Пока Рез.Следующий() Цикл 
			//Ном = Рез.Номенклатура;
			СЗ = Новый Структура;
			СЗ.Вставить("Номенклатура",Рез.Номенклатура);
			СЗ.Вставить("Серия",""); 
			Мас.Добавить(СЗ);
			
		КонецЦикла
	Иначе
		Мас = Ложь;	
	КонецЕсли;
	
	Возврат Мас;
	
КонецФункции  

//&НаСервере
//Функция ПоискQR(Ш,сим)
//	Запрос = Новый Запрос;
//	//|	РегистрСведений.Расш1_РегистрШтрихЭтикетка КАК ШтрихкодыНоменклатуры
//	
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
//	               |	ТоварыНаСкладахОстатки.Серия КАК Серия,
//	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
//	               |ИЗ
//	               |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
//	               |ГДЕ
//	               |	(ТоварыНаСкладахОстатки.Склад = &Склад ИЛИ ТоварыНаСкладахОстатки.Склад = &СкладГП) И
//	               |	ТоварыНаСкладахОстатки.Серия.Наименование ПОДОБНО &Серия";   
//				   //|	ТоварыНаСкладахОстатки.Серия.Наименование =  &Серия";

//	СтрокаСерия = Лев(Ш,сим);
//	СтрокаСерия = СтрокаСерия+Строка("%"+Прав(Ш,11));
//	Запрос.УстановитьПараметр("Серия", СтрокаСерия); 
//	Запрос.УстановитьПараметр("Склад", Справочники.Склады.НайтиПоНаименованию("ЦС Цех Снеки"));
//	Запрос.УстановитьПараметр("СкладГП", Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
//	Рез = Запрос.Выполнить().Выбрать(); 
//	Мас = Новый Массив;
//	

//	Если Рез.Количество()>0 Тогда
//		Пока Рез.Следующий() Цикл
//			СЗ = Новый Структура;
//			СЗ.Вставить("Номенклатура",Рез.Номенклатура);
//			СЗ.Вставить("Серия",Рез.Серия); 
//			Мас.Добавить(СЗ);
//		КонецЦикла;		//Ном = Рез.Номенклатура; 
//	Иначе
//		Мас = Ложь;	
//	КонецЕсли;
//	
//	Возврат Мас;
//	
//КонецФункции 

&НаСервере
Функция ПоискQR(Ш,сим)
	Запрос = Новый Запрос;
	//|	РегистрСведений.Расш1_РегистрШтрихЭтикетка КАК ШтрихкодыНоменклатуры
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	               |	ЗаказНаПроизводство2_2Продукция.Расш1_Серия КАК Расш1_Серия
	               |ИЗ
	               |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	               |ГДЕ
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка.Дата >= &Дата
	               |	И ЗаказНаПроизводство2_2Продукция.Расш1_Серия.Наименование ПОДОБНО &Серия";   
				   //|	ТоварыНаСкладахОстатки.Серия.Наименование =  &Серия";

	СтрокаСерия = Лев(Ш,сим);
	СтрокаСерия = СтрокаСерия+Строка("%"+Прав(Ш,11));
	Запрос.УстановитьПараметр("Серия", СтрокаСерия);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата())-7*86400); 	
	Рез = Запрос.Выполнить().Выбрать(); 
	Мас = Новый Массив;
	

	Если Рез.Количество()>0 Тогда
		Пока Рез.Следующий() Цикл
			СЗ = Новый Структура;
			СЗ.Вставить("Номенклатура",Рез.Номенклатура);
			СЗ.Вставить("Серия",Рез.Расш1_Серия); 
			Мас.Добавить(СЗ);
		КонецЦикла;		//Ном = Рез.Номенклатура; 
	Иначе
		Мас = Ложь;	
	КонецЕсли;
	
	Возврат Мас;
	
КонецФункции 

&НаСервере
Функция ПроверкаНаЧисло(НашаСтрокаДляРазбора) Экспорт
	Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Строка") Тогда
			Если НашаСтрокаДляРазбора = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ПМ = Число(НашаСтрокаДляРазбора);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЕсли;
КонецФункции 

&НаКлиенте
Процедура Отмена(Команда)
	Элементы.ГруппаНоменклатура.Видимость = Ложь;
	Элементы.ГруппаДокумент.Видимость = Истина;
    ЗаполнитьТаблицу();
КонецПроцедуры

&НаСервере
Функция ДобавитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Расш1_ПоступлениеСклад.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Расш1_ПоступлениеСклад КАК Расш1_ПоступлениеСклад
	               |ГДЕ
	               |	Расш1_ПоступлениеСклад.ПометкаУдаления = &ПометкаУдаления
	               |	И Расш1_ПоступлениеСклад.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И Расш1_ПоступлениеСклад.Проведен = &Проведен"; 
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);  
	Запрос.УстановитьПараметр("Проведен", Истина);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())); 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Серия = "" Тогда
		Ош = "Заполните серию";
	ИначеЕсли Количество = 0 Тогда
		Ош = "Заполните количество";
	Иначе
		
	
	
	
	Если Рез.Следующий() Тогда
		ТекДок = Рез.Ссылка.ПолучитьОбъект();
		НоваяСтрока = ТекДок.Товары.Добавить();
	    НоваяСтрока.Номенклатура = Номенклатура;
	    НоваяСтрока.Серия = Серия;
	    НоваяСтрока.Количество = Количество; 
		НоваяСтрока.Время = ТекущаяДата();
		ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ТекДок = Документы.Расш1_ПоступлениеСклад.СоздатьДокумент(); 
		ТекДок.Дата =ТекущаяДата(); 
		ТекДок.Склад = Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции");
		НоваяСтрока = ТекДок.Товары.Добавить();
	    НоваяСтрока.Номенклатура = Номенклатура;
	    НоваяСтрока.Серия = Серия;
	    НоваяСтрока.Количество = Количество; 
		НоваяСтрока.Время = ТекущаяДата();
		ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	 Ош = Ложь;	
	КонецЕсли;
	Возврат Ош;

КонецФункции

&НаКлиенте
Процедура Добавить(Команда)
	Д = ДобавитьНаСервере();
	Если Д = Ложь Тогда 
		Элементы.ГруппаНоменклатура.Видимость = Ложь;
	    Элементы.ГруппаДокумент.Видимость = Истина;
	Иначе
		Сообщить(Д);
	КонецЕсли;
	ЗаполнитьТаблицу();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицу()
	ТЗ.Очистить();
	Для Каждого стр из ТекДокумент.Товары Цикл
		Т = ТЗ.Добавить();
		Т.НомерСтроки = стр.НомерСтроки;
		Т.Номенклатура = стр.Номенклатура;
		Т.Количество = стр.Количество; 
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Расш1_ПоступлениеСклад.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Расш1_ПоступлениеСклад КАК Расш1_ПоступлениеСклад
	               |ГДЕ
	               |	Расш1_ПоступлениеСклад.ПометкаУдаления = &ПометкаУдаления
	               |	И Расш1_ПоступлениеСклад.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И Расш1_ПоступлениеСклад.Проведен = &Проведен"; 
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);  
	Запрос.УстановитьПараметр("Проведен", Истина);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())); 
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Количество() = 0 Тогда
		ТекДок = Документы.Расш1_ПоступлениеСклад.СоздатьДокумент(); 
		ТекДок.Дата =ТекущаяДата(); 
		ТекДок.Склад = Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции");
		ТекДок.Записать(РежимЗаписиДокумента.Проведение);
		ТекДокумент = ТекДок.Ссылка;  
	Иначе  
		Пока Рез.Следующий() Цикл
			ТекДокумент = Рез.Ссылка;	
		КонецЦикла;
	КонецЕсли;  
	ЗаполнитьТаблицу();
КонецПроцедуры

&НаСервере
Процедура ТекДокументТоварыВыборНаСервере(ВыбраннаяСтрока)
	НомерСтроки =  ВыбраннаяСтрока-1;
	Строка = ТекДокумент.Товары[ВыбраннаяСтрока-1];
	Номенклатура = Строка.Номенклатура; 
	Количество = Строка.Количество; 
	Серия = Строка.Серия; 
	

КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере(НомерСтроки) 
	Док = ТекДокумент.ПолучитьОбъект();
	Док.Товары.Удалить(НомерСтроки);
	Док.Записать(РежимЗаписиДокумента.Проведение);
	ЗаполнитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)     
	Элементы.ГруппаНоменклатура.Видимость = Ложь;
	Элементы.ГруппаДокумент.Видимость = Истина;
	УдалитьНаСервере(НомерСтроки);
КонецПроцедуры


&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.ГруппаНоменклатура.Видимость = Истина; 
	Элементы.ГруппаДокумент.Видимость = Ложь; 
	Элементы.Удалить.Видимость = Истина;  
	Элементы.Добавить.Видимость = Ложь;  
	
	ТекДокументТоварыВыборНаСервере(Элемент.ТекущиеДанные.НомерСтроки);

КонецПроцедуры
